{
  "source": "We have evey recipe from https://www.budgetbytes.com/category/recipes/vegetarian/vegan/",
  "recipes":[
    {
      "name": "Vegan winter lentil stew",
      "prep time": "10 min",
      "cook time": "50 min",
      "servings": "8",
      "ingredients": [
        "2 Tbsp olive oil",
        "1 yellow onion",
        "4 cloves garlic",
        "4 carrots (about 1/2 lb.)",
        "4 stalks celery",
        "2 lbs potatoes",
        "1 cup brown lentils",
        "1 tsp dried rosemary",
        "1/2 tsp dried thyme",
        "2 Tbsp Dijon mustard",
        "1.5 Tbsp soy sauce",
        "1 Tbsp brown sugar",
        "6 cups vegetable broth",
        "1 cup frozen peas"
      ],
        "instructions":[
        "Dice the onion and mince the garlic. Add the olive oil, onion, and garlic to a large soup pot and begin to sauté over medium heat.",
        "While the onion and garlic are sautéing, dice the celery, then add it to the pot and continue to sauté. As the celery, onion, and garlic are sautéing, peel and chop the carrots into half rounds. Add the carrots to the pot and continue to sauté.",
        "As the onion, garlic, celery, and carrots are sautéing, peel and cube the potatoes into 3/4 to 1-inch pieces. Add the cubed potatoes to the pot along with the lentils, rosemary, thyme, Dijon, soy sauce, brown sugar, and vegetable broth.",
        "Briefly stir the ingredients to combine, then place a lid on the pot, turn the heat up to high, and bring the stew up to a boil. Once it reaches a boil, turn the heat down to low and let it simmer for 30 minutes, stirring occasionally.",
        "Toward the end of the simmer time, when the potatoes are very soft, begin to mash the potatoes a bit as you stir. This will help thicken the stew.",
        "Finally, after 30 minutes, stir in the frozen peas and allow them to heat through. Taste the stew and add salt if needed (this will depend on the salt content of your broth, I did not add any extra). Serve hot and enjoy!"
        ]
    },
    {
      "name": "Vegan creamy mushroom ramen",
      "prep time": "3 min",
      "cook time": "12 min",
      "servings": "1",
      "ingredients": [
        "1/2 Tbsp cooking oil",
        "4 oz. baby bella mushrooms",
        "1.5 cups vegetable broth",
        "1 handful fresh spinach",
        "1 package ramen noodles (discard seasoning)",
        "1/2 cup coconut milk (canned)"
      ],
      "instructions":[
        "Slice the mushrooms. Add them to a small sauce pot with the cooking oil and sauté over medium heat until the mushrooms are soft, dark, and all the moisture in the bottom of the pot has evaporated.",
        "Add the vegetable broth, turn the heat up to medium-high, and bring the broth up to a boil. Once boiling, add the ramen noodles (without the seasoning packet) to the broth. Cook the noodles in the boiling broth for about 3 minutes, or until tender.",
        "Turn the heat off, add a heaping handful of fresh spinach, and stir until the spinach is wilted (about 30 seconds). Pour the coconut milk into the pot and stir to combine.",
        "Serve the Vegan Creamy Coconut Ramen as-is, or with garnishes like green onion or chili garlic sauce."
      ]
    },
    {
      "name": "Vegan west african peanut stew",
      "prep time": "10 min",
      "cook time": "45 min",
      "servings": "6",
      "ingredients": [
        "1 Tbsp olive oil",
        "4 cloves garlic",
        "1 Tbsp grated fresh ginger",
        "1 sweet potato (about 1 lb.)",
        "1 medium onion",
        "1 tsp cumin",
        "1/4 tsp crushed red pepper",
        "1 6oz. can tomato paste",
        "1/2 cup natural style peanut butter",
        "6 cups vegetable broth",
        "1/2 bunch collard greens (4-6 cups chopped)"
      ],
      "instructions":[
        "Peel and grate the ginger using a small holed cheese grater. Mince the garlic, and dice the onion. Sauté the onion, ginger, and garlic in a large pot with the olive oil over medium heat for 2-3 minutes, or until the onion becomes soft and translucent.",
        "While the onion, ginger, and garlic are sautéing, peel and dice the sweet potato into 1/2-inch cubes. Add the sweet potato cubes, cumin, and red pepper to the pot and continue to sauté for about 5 minutes.",
        "Add the tomato paste, peanut butter, and vegetable broth to the pot. Stir until the peanut butter and tomato paste have mostly dissolved into the broth. Place a lid on the pot and turn the heat up to high. Allow the stew to come up to a boil. Once it reaches a boil, turn the heat down to medium-low and allow it to simmer for 15-20 minutes, or until the sweet potatoes are very soft.",
        "While the soup is simmering, prepare the collard greens. Use a sharp knife to remove each stem (cut along the side of each stem), then stack the leaves and cut them into 1/2-inch wide strips. Place the chopped collard greens in a colander and rinse very well",
        "Once the stew has simmered for 15-20 minutes and the sweet potatoes are very soft, stir in the collard greens. Let the stew simmer for about 5 minutes more, then begin to smash the sweet potatoes against the side of the pot to help thicken the stew.",
        "Finally, taste the stew and add salt or red pepper, if desired. Serve the stew with a scoop of cooked rice (about 3/4 cup), a few chopped peanuts, fresh cilantro, and a drizzle of sriracha, if desired."
      ]
    },
    {
      "name": "Vegan red lentil stew",
      "prep time": "5 min",
      "cook time": "45 min",
      "servings": "6",
      "ingredients": [
        "2 Tbsp olive oil",
        "1 medium yellow onion",
        "2 cloves garlic",
        "3 oz tomato paste",
        "1 cup dry red lentils",
        "1/2 lb carrots",
        "1 medium potato",
        "6 cups vegetable broth**",
        "1 Tbsp cumin",
        "1 tsp smoked paprika",
        "3/4 tsp salt",
        "1/8 tsp cayenne pepper"
      ],
      "instructions":[
        "Dice the onion and mince the garlic. Cook both in a large pot with olive oil over medium heat until soft and transparent (about 5 minutes). Add the tomato paste and continue to stir and cook for about 3-4 minutes more. The tomato paste will caramelize during this time, which will make it sweeter and cause it to look slightly darker.",
        "While the ingredients in the first step are cooking, peel and dice the potato and carrots. Rinse the lentils. Once the tomato paste has caramelized, add the carrots, potato, and lentils to the pot.",
        "Also add 6 cups of vegetable broth, cumin, smoked paprika, and cayenne pepper. Give everything a good stir to make sure it’s mixed well. Place a lid on top, turn the heat up to high, and bring the soup to a boil. As soon as it reaches a full boil, turn the heat down to its lowest level and allow it to simmer for 30 minutes.",
        "After it has simmered for 30 minutes give the pot a stir and add the salt, starting with 1/2 teaspoon. Add more if desired. I used about 3/4 teaspoon total. Serve hot!"
      ]
    },
    {
      "name": "Vegan red beans and rice",
      "prep time": "1 day",
      "cook time": "3 hours",
      "servings": "6",
      "ingredients": [
        "2 Tbsp olive oil",
        "1 medium yellow onion",
        "1 medium bell pepper",
        "4 stalks celery",
        "4 cloves garlic",
        "1 lb dry red beans",
        "6 cups vegetable broth*",
        "1 tsp thyme",
        "1 tsp oregano",
        "1 whole bay leaf",
        "1/2 Tbsp smoked paprika",
        "Freshly cracked pepper (about 10-15 cranks of a pepper mill)",
        "pinch cayenne pepper",
        "6 cups cooked rice",
        "1 bunch green onions, sliced"
      ],
      "instructions":[
        "The night before, Place your beans in a large pot and fill with enough cool water to cover the beans by a few inches. Place the beans in the refrigerator to soak over night.",
        "When you're ready to cook, finely dice the celery, bell pepper, and onion, and mince the garlic. Cook the celery, bell pepper, onion, and garlic in a large pot with the olive oil over medium heat until softened (5-7 minutes).",
        "Drain the soaked beans in a colander and rinse with fresh, cool water. Add the rinsed beans to the pot with the vegetables. Also add the vegetable broth, thyme, oregano, bay leaf, smoked paprika, some freshly cracked pepper, and a pinch of cayenne pepper.",
        "Place a lid on the pot and bring it up to a full boil over high heat. After it reaches a boil, turn the heat down to low and allow the pot to simmer for at least two hours. Make sure the pot is simmering the entire time, increasing the heat if needed. Stir the pot occasionally to make sure nothing is sticking to the bottom. Keep the lid in place the entire time to keep the beans from drying out.",
        "After two hours (or longer if desired) the beans should be soft and tender. Mash some of the beans against the side of the pot with the back of a spoon. This will thicken the pot and make the classic, creamy texture of the dish. Remove the bay leaf and allow the pot to simmer for about 30 minutes more (after smashing) to help it thicken.",
        "To serve, add a scoop of red beans to a bowl and top with a scoop warm, cooked rice. Sprinkle sliced green onions over top and add a dash of hot sauce if desired."
      ]
    },
    {
      "name": "Creamy vegetable wild rice soup",
      "prep time": "10 min",
      "cook time": "1 hour",
      "servings": "4",
      "ingredients": [
        "8 oz. baby bella mushrooms ($1.69)",
        "2 Tbsp olive oil ($0.32)",
        "2 cloves garlic ($0.16)",
        "1 yellow onion ($0.32)",
        "3 ribs celery ($0.37)",
        "1/2 lb. carrots ($0.45)",
        "1/4 tsp dried thyme ($0.03)",
        "1/4 tsp dried sage ($0.03)",
        "1 cup wild rice blend (uncooked) ($1.55)",
        "4 cups vegetable broth ($0.52)",
        "1 13 oz. can full-fat coconut milk ($2.49)"
      ],
      "instructions":[
        "Wash and slice the mushrooms. Add the olive oil and mushrooms to a large soup pot and sauté over medium heat until the mushrooms are fully wilted and browned on the edges (cook until all the moisture is released, evaporated, and the mushrooms begin to actually brown for the best flavor).",
        "While the mushrooms are sautéing, mince the garlic, dice the onion, slice the celery, and peel and slice the carrots.",
        "Add the garlic, onion, celery, carrots, thyme, and sage to the pot with the mushrooms. Continue to sauté for about five minutes more, or until the onions are soft.",
        "Finally, add the wild rice blend and vegetable broth, and stir to combine. Place a lid on the pot, turn the heat up to medium-high, and bring it to a boil. Once boiling, turn the heat down and let the soup simmer for about 45 minutes with the lid in place (or however long the instructions on your brand of rice suggests for cooking).",
        "Once the soup has simmered and the rice is tender, add the coconut milk. Stir to combine and allow it to simmer for about 5 minutes more. Finally, taste the soup and add salt if needed (I did not add any, but this will depend on the salt content of your broth). Serve hot with crusty bread for dipping!"
      ]
    },
    {
      "name": "Slow cooker white bean soup",
      "prep time": "15 min",
      "cook time": "8 hour",
      "servings": "6",
      "ingredients": [
        "22 Tbsp olive oil",
        "24 cloves garlic",
        "21 medium yellow onion",
        "21/2 lb carrots",
        "24 stalks celery (1/2 bunch)",
        "21 lb dry navy beans*",
        "21 whole bay leaf",
        "21 tsp dried rosemary",
        "21/2 tsp dried thyme",
        "21/2 tsp smoked paprika",
        "2Freshly cracked pepper (15-20 cranks of a pepper mill)",
        "21 1/2 tsp salt or more to taste"
      ],
      "instructions":[
        "Mince the garlic, dice the onion, slice the celery, and slice the carrots into thin rounds. Add the olive oil, garlic, onion, celery, and carrots to a large (5qt or larger) slow cooker.",
        "Sort through the beans and remove any debris or stones. Give them a quick rinse and then add them to the slow cooker, along with the bay leaf, rosemary, thyme, paprika, and some freshly cracked pepper.",
        "Add SIX CUPS of water to the slow cooker and stir to combine the ingredients. Place the lid on the slow cooker and cook for 8 hours on low or on high for 4-5 hours.",
        "After 8 hours, stir the soup and mash the beans slightly. Starting with just a 1/2 tsp, add salt to your liking. I used about 2 tsp total, but keep tasting and adding more, 1/2 tsp at a time, until it reaches the level that you prefer.",
        "Note",
        "*Make sure to get navy beans, not cannellini beans, which are related to the kidney bean.",
        "Kidney beans and cannellini beans contain a high level of phytohemagglutinin, which is a strong, naturally occurring gastrointestinal toxin.",
        "The levels of this toxin can actually increase if the beans are not fully boiled for ten minutes.",
        "If you're unsure about your beans, boil the beans on the stove top for at least ten minutes before adding to the slow cooker with the rest of the ingredients."
      ]
    },
    {
      "name": "Sesame tempeh bowls",
      "prep time": "10 min",
      "cook time": "10 min",
      "servings": "4",
      "ingredients": [
        "1/4 cup soy sauce",
        "2 Tbsp water",
        "1 Tbsp sesame oil",
        "3 Tbsp brown sugar",
        "1 Tbsp rice vinegar",
        "1 tsp grated fresh ginger",
        "2 cloves garlic, minced",
        "1 Tbsp sesame seeds",
        "1/2 Tbsp cornstarc",
        "8 oz. tempeh",
        "2 green onions, sliced",
        "4 cups cooked jasmine rice*",
        "1 lb. frozen broccoli florets"
      ],
      "instructions":[
        "Begin by mixing together the sesame sauce. In a medium bowl, stir together the soy sauce, 2 Tbsp water, sesame oil, brown sugar, rice vinegar, grated ginger, minced garlic, sesame seeds, and cornstarch until the cornstarch is dissolved. Set the sauce aside.",
        "Cut the brick of tempeh into 8 squares, then cut each square diagonally into a triangle. Turn each triangle on its side and slice it in half so you have two thinner triangles. To achieve the proper tempeh to sauce ratio, you don't want thick pieces. ",
        "Place the tempeh in a large skillet and add 1/2 cup water. Place the skillet over medium-high heat and let the tempeh simmer until all of the water evaporates (about 5-8 minutes). Flip the tempeh a couple times as it simmers.",
        "Once the water has evaporated, turn the heat down to medium and pour in the sesame sauce. The skillet will still be quite hot, so the sauce may begin to thicken immediately. Stir the tempeh in the sauce until the sauce has thickened (1-2 minutes), then remove it from the heat immediately to prevent further evaporation and thickening.",
        "To build the bowls, place one cup of rice in each dish, top with 1/4 of the sesame tempeh, 1/4 of the broccoli florets, and a sprinkle of green onion.",
        "Note",
        "*You can sub brown rice or plain white rice if desired."
      ]
    },
    {
      "name": "Parsley scallion hummus pasta",
      "prep time": "15 min",
      "cook time": "15 min",
      "servings": "4",
      "ingredients": [
        "15 oz. can chickpeas",
        "1/4 cup olive oil",
        "1 fresh lemon, or 1/4 cup juice",
        "1/4 cup tahini",
        "1 clove garlic, or 1/4 tsp garlic powder",
        "1/4 tsp cumin",
        "1/2 tsp salt",
        "2 scallions (green onions)",
        "1/4 bunch fresh parsley, or to taste",
        "8 oz. pasta"
      ],
      "instructions":[
        "Drain the chickpeas and add them to a food processor along with the olive oil, juice from the lemon (about 1/4 cup), tahini, garlic, cumin, and salt. Pulse the ingredients, adding a small amount of water if needed to keep it moving, until the hummus is smooth.",
        "Slice the scallions (both white and green ends) and pull the parsley leaves from the stems. Add the green onion and parsley to the hummus in the food processor and process again until only small flecks of green remain. Taste the hummus and adjust the salt, lemon, or garlic if needed.",
        "Cook 8oz. of your favorite pasta according to the package directions. Reserve one cup of the starchy cooking water, then drain the cooked pasta in a colander. Return the drained pasta to the pot with the heat turned off. Add about 3/4 of the hummus to the pasta and stir until the pasta is evenly coated (add more hummus if needed). Add the reserved pasta water as needed to keep the mixture smooth and saucy. Serve immediately.  "
      ]
    },
    {
      "name": "Secret ingredient tomato soup",
      "prep time": "5 min",
      "cook time": "25 hours",
      "servings": "4",
      "ingredients": [
        "2 Tbsp olive oil",
        "1 clove garlic, minced",
        "1/2 tsp dried oregano",
        "1/2 tsp dried basil",
        "1/4 tsp dried thyme",
        "1/4 tsp dried rosemary",
        "1 pinch crushed red pepper",
        "freshly cracked black pepper",
        "3 oz. tomato paste",
        "1 Tbsp brown sugar",
        "1 28 oz. can crushed tomatoes",
        "2 cups vegetable broth",
        "1 15 oz. can cannellini beans",
        "1 Tbsp nutritional yeast",
        "1/4 tsp salt, or to taste"
      ],
      "instructions":[
        "Add the olive oil, minced garlic, oregano, basil, thyme, rosemary, crushed red pepper, and some freshly cracked black pepper (about 10 cranks of a pepper mill) to a soup pot. Cook and stir the herbs and oil over medium heat for about one minute, or until the garlic is soft and fragrant.",
        "Add the tomato paste and brown sugar. Continue to stir and cook the tomato paste mixture over medium heat for 2-3 minutes.",
        "Pour the crushed tomatoes and vegetable broth into the pot and stir to combine. As the soup begins to heat through, add a can of cannellini beans (with the liquid from the can) to a blender and purée until completely smooth. Pour the pouréed beans into the soup and stir to combine again.",
        "Place a lid on the pot and allow it to come up to a simmer. Once simmering, turn the heat down to medium low and let it simmer, stirring occasionally, for 20 minutes.",
        "After simmering for 20 minutes, add the nutritional yeast and stir to combine. Taste the soup and add salt to taste (about 1/4 tsp). Serve hot."
      ]
    },
    {
      "name": "Slow simmered black eye peas and greens",
      "prep time": "8 hours",
      "cook time": "2 hours",
      "servings": "5",
      "ingredients": [
        "1 lb. black eyed peas (dry)",
        "2 Tbsp olive oil",
        "1 onion",
        "3 cloves garlic",
        "1/2 bunch celery",
        "1 tsp oregano",
        "1/2 Tbsp smoked paprika",
        "1/4 tsp cayenne pepper",
        "Freshly cracked pepper",
        "1 bay leaf",
        "6 cups vegetable broth",
        "12 oz. fresh greens*"
      ],
      "instructions":[
        "The night before, place the black eyed peas in a large bowl or container and fill with cool water (there should be at least three times as much water as peas). Allow the peas to soak overnight in the refrigerator.",
        "When you're ready to begin cooking, add the olive oil to a large pot. Dice the onion, mince the garlic, and slice the celery. Add the onion, garlic, and celery to the pot and sauté over medium heat until the onions are transparent. ",
        "Drain the soaked peas in a colander and rinse them with cool water. Add the rinsed peas to the pot with the vegetables. Also add the oregano, smoked paprika, cayenne pepper, some freshly cracked pepper (about 20 cranks of a pepper mill), bay leaf, and vegetable broth. Stir to combine.",
        "Add a lid to the pot, turn the heat up to high, and bring the pot to a boil. Once it reaches a boil, turn the heat down to low, and allow it to simmer for 1 hour.",
        "After one hour of simmering, the black eyed peas should be tender. Add the greens to the pot and stir them in until wilted. Smash some of the peas against the side of the pot as you stir to help thicken the liquid. ",
        "Turn the heat up to medium to bring the pot back up to a simmer, and allow the peas and greens to simmer for 30 minutes more, without a lid. After simmering for 30 minutes, the greens should be tender and the peas should have broken down further and thickened the liquid even more. Taste the peas and add salt to your liking (I added about 3/4 tsp, but the amount needed will depend on the salt content of your vegetable broth). Serve with crusty bread or over rice.",
        "Notes",
        "*I used bagged pre-chopped mustard greens, but you can use other hearty greens like collard greens or kale. If using greens in a bunch, remove the stems and chop the leaves into 1 to 2-inch pieces."
      ]
    },
    {
      "name": "Garden vegetable quinoa soup",
      "prep time": "10 min",
      "cook time": "40 min",
      "servings": "8",
      "ingredients": [
        "1 Tbsp olive oil",
        "1 yellow onion",
        "4 cloves garlic",
        "3 carrots",
        "3 ribs celery",
        "15 oz. can kidney beans",
        "15 oz. can fire roasted diced tomatoes",
        "1/2 tsp dried basil",
        "1 tsp dried oregano",
        "1/2 tsp smoked paprika",
        "Freshly cracked pepper",
        "1 cup uncooked quinoa",
        "4 cups vegetable broth*",
        "2 cups water",
        "1/4 lb. frozen spinach"
      ],
      "instructions":[
        "Mince the garlic and dice the onion. Add the olive oil, garlic, and onion to a large pot and sauté over medium-low heat until the onions are soft and transparent.",
        "While the garlic and onion are cooking, wash and peel the carrots, then slice into 1/4-inch thick rounds. Wash the celery and slice into 1/4-inch pieces. Add the carrots and celery to the pot and continue to sauté until they just begin to soften (about 5 minutes).",
        "While the carrots and celery are cooking, rinse the quinoa well with cool running water in a wire mesh sieve. Drain and rinse the kidney beans. Add the quinoa, kidney beans, diced tomatoes (with juices), basil, oregano, smoked paprika, and some freshly cracked pepper (about 20 cranks of a pepper mill) to the pot.",
        "Add the vegetable broth and water to the pot, place a lid on top, and turn the heat up to medium-high. Allow the pot to come to a boil, then turn the heat down to low and let simmer for 25 minutes (make sure it's simmering the entire time, turning the heat up just slightly if it stops).",
        "After simmering for 25 minutes the quinoa should be slightly translucent and tender. If not, let simmer a few minutes longer. Stir in 1/4 lb. of frozen spinach until heated through. Taste the soup and add salt or adjust the seasonings if necessary. Serve hot.",
        "Notes",
        "*I use Better Than Bouillon to make my broth. If you use a low sodium broth, you may need to add a pinch of salt to the finished soup."
      ]
    },
    {
      "name": "Slow simmered black eye peas and greens",
      "prep time": "8 hours",
      "cook time": "2 hours",
      "servings": "5",
      "ingredients": [
        "1 lb. black eyed peas (dry)",
        "2 Tbsp olive oil",
        "1 onion",
        "3 cloves garlic",
        "1/2 bunch celery",
        "1 tsp oregano",
        "1/2 Tbsp smoked paprika",
        "1/4 tsp cayenne pepper",
        "Freshly cracked pepper",
        "1 bay leaf",
        "6 cups vegetable broth",
        "12 oz. fresh greens*"
      ],
      "instructions":[
        "The night before, place the black eyed peas in a large bowl or container and fill with cool water (there should be at least three times as much water as peas). Allow the peas to soak overnight in the refrigerator.",
        "When you're ready to begin cooking, add the olive oil to a large pot. Dice the onion, mince the garlic, and slice the celery. Add the onion, garlic, and celery to the pot and sauté over medium heat until the onions are transparent. ",
        "Drain the soaked peas in a colander and rinse them with cool water. Add the rinsed peas to the pot with the vegetables. Also add the oregano, smoked paprika, cayenne pepper, some freshly cracked pepper (about 20 cranks of a pepper mill), bay leaf, and vegetable broth. Stir to combine.",
        "Add a lid to the pot, turn the heat up to high, and bring the pot to a boil. Once it reaches a boil, turn the heat down to low, and allow it to simmer for 1 hour.",
        "After one hour of simmering, the black eyed peas should be tender. Add the greens to the pot and stir them in until wilted. Smash some of the peas against the side of the pot as you stir to help thicken the liquid. ",
        "Turn the heat up to medium to bring the pot back up to a simmer, and allow the peas and greens to simmer for 30 minutes more, without a lid. After simmering for 30 minutes, the greens should be tender and the peas should have broken down further and thickened the liquid even more. Taste the peas and add salt to your liking (I added about 3/4 tsp, but the amount needed will depend on the salt content of your vegetable broth). Serve with crusty bread or over rice.",
        "NOTES",
        "*I used bagged pre-chopped mustard greens, but you can use other hearty greens like collard greens or kale. If using greens in a bunch, remove the stems and chop the leaves into 1 to 2-inch pieces."
      ]
    },
    {
      "name": "Garden vegetable quinoa soup",
      "prep time": "10 min",
      "cook time": "40 min",
      "servings": "8",
      "ingredients": [
        "1 Tbsp olive oil",
        "1 yellow onion",
        "4 cloves garlic",
        "3 carrots",
        "3 ribs celery",
        "15 oz. can kidney beans",
        "15 oz. can fire roasted diced tomatoes",
        "1/2 tsp dried basil",
        "1 tsp dried oregano",
        "1/2 tsp smoked paprika",
        "Freshly cracked pepper",
        "1 cup uncooked quinoa",
        "4 cups vegetable broth*",
        "2 cups water",
        "1/4 lb. frozen spinach"
      ],
      "instructions":[
        "Mince the garlic and dice the onion. Add the olive oil, garlic, and onion to a large pot and sauté over medium-low heat until the onions are soft and transparent.",
        "While the garlic and onion are cooking, wash and peel the carrots, then slice into 1/4-inch thick rounds. Wash the celery and slice into 1/4-inch pieces. Add the carrots and celery to the pot and continue to sauté until they just begin to soften (about 5 minutes).",
        "While the carrots and celery are cooking, rinse the quinoa well with cool running water in a wire mesh sieve. Drain and rinse the kidney beans. Add the quinoa, kidney beans, diced tomatoes (with juices), basil, oregano, smoked paprika, and some freshly cracked pepper (about 20 cranks of a pepper mill) to the pot.",
        "Add the vegetable broth and water to the pot, place a lid on top, and turn the heat up to medium-high. Allow the pot to come to a boil, then turn the heat down to low and let simmer for 25 minutes (make sure it's simmering the entire time, turning the heat up just slightly if it stops).",
        "After simmering for 25 minutes the quinoa should be slightly translucent and tender. If not, let simmer a few minutes longer. Stir in 1/4 lb. of frozen spinach until heated through. Taste the soup and add salt or adjust the seasonings if necessary. Serve hot.",
        "NOTES",
        "*I use Better Than Bouillon to make my broth. If you use a low sodium broth, you may need to add a pinch of salt to the finished soup."
      ]
    },
    {
      "name": "Curried chickpeas with spinach",
      "prep time": "5 min",
      "cook time": "20 min",
      "servings": "4",
      "ingredients": [
        "2 Tbsp olive oil ($0.26)",
        "1 small onion ($0.47)",
        "2 cloves garlic ($0.16)",
        "1 inch fresh ginger ($0.16)",
        "1 1/2 Tbsp curry powder ($0.45)",
        "8 oz spinach fresh or frozen ($1.49)",
        "15 oz can tomato sauce ($0.59)",
        "29 oz can chickpeas ($1.10)"
      ],
      "instructions":[
        "Dice the onion, mince the garlic, and grate the ginger on a small holed cheese grater. Sauté the onion, garlic, and ginger in a large skillet with the olive oil over medium heat until the onions have softened (3-5 minutes).",
        "Add the curry powder and continue to sauté with the onion mixture for one minute more. Add about 1/4 cup of water to the skillet along with the fresh spinach and continue to sauté until the spinach has wilted. The water will help steam and wilt the spinach (no water needed if using frozen spinach).",
        "Drain and rinse the chickpeas. Add them to the skillet along with the tomato sauce. Stir well to distribute the spices in the sauce and heat through (5 minutes). Serve over rice or with bread."
      ]
    },
    {
      "name": "Quinoa black bean tacos",
      "prep time": " min",
      "cook time": " min",
      "servings": "8",
      "ingredients": [
        "1 cup uncooked quinoa",
        "1 clove garlic",
        "1/2 tsp salt",
        "1/2 Tbsp chili powder",
        "1/4 tsp cumin",
        "1/4 tsp oregano",
        "1/4 tsp smoked paprika",
        "2 cups cooked black beans*",
        "1 recipe pico de gallo",
        "1 medium avocado",
        "16 small corn tortillas",
        "1/4 bunch cilantro"
      ],
      "instructions":[
        "Use a wire mesh sieve to rinse the quinoa very, very well (this removes the bitter taste). If you don’t have a wire mesh sieve, you can put the quinoa in a bowl with water, swish it around and carefully pour off the water. Repeat this process until the water is fairly clear.",
        "Put the rinsed quinoa in a medium pot along with the clove of garlic (minced), salt, chili powder, cumin, oregano, smoked paprika, and 1.5 cups of water. Stir to combine. Put a lid on the pot, turn the heat on to high, and bring it up to a boil. As soon as it reaches a boil, turn the heat down to low and let simmer for 15 minutes. After 15 minutes, turn the heat off and let it sit (with the lid in place) for an additional 10 minutes.",
        "While the quinoa is cooking, prepare the pico de gallo according to these directions (it’s as easy as chop and stir). Rinse the black beans well in a colander and allow the excess water to drain off.",
        "When the quinoa has finished cooking, remove the lid and fluff with a fork. Add the drained black beans and stir to combine.",
        "Lightly toast the tortillas in a skillet over medium heat until each side is just slightly golden brown (tortillas should still be pliable). To make each taco, place about 1/4 cup of the quinoa/black bean mixture in the center of a tortilla. Add about 1-2 tablespoons of pico de gallo, one slice of avocado, and a few sprigs of cilantro. Fold and eat!",
        "Note",
        "*I used black beans that I had cooked in my slow cooker, but you can replace this with one 15-ounce can of black beans."
      ]
    },
    {
      "name": "Smoky black bean soup",
      "prep time": "5 min",
      "cook time": "20 min",
      "servings": "4",
      "ingredients": [
        "1 yellow onion",
        "2 cloves garlic",
        "1 jalapeño (optional)",
        "2 Tbsp olive oil",
        "3 15oz. cans black beans",
        "1 15oz. can fire roasted diced tomatoes",
        "1 tsp ground cumin",
        "1/2 tsp dried oregano",
        "1/2 tsp smoked paprika or chipotle powder*",
        "salt to taste"
      ],
      "instructions":[
        "Dice the onion and mince the garlic. Remove the stem and seeds from the jalapeño, then dice the remaining jalapeño flesh. Add the onion, garlic, jalapeño, and olive oil to a soup pot and sauté over medium heat for about 5 minutes, or until the onions are soft and translucote",
        "While the onion, garlic, and jalapeño are sautèing, use a blender to purée two of the three cans of black beans (with liquid from the can). If the beans are too thick to purée, add just enough water to make them blote",
        "Add all three cans of black beans to the soup pot (one can of whole beans with liquid, two puréed), along with the can of fire roasted diced tomatoes (with juices), the cumin, oregano, and smoked paprika. Stir to combote",
        "Place a lid on the pot and allow the soup to come up to a simmer. Allow the soup to simmer, stirring often, for about 15 minutes. After simmering for 15 minutes, taste and add salt to taste (I added 1/2 tsp). Serve hot with your choice of toppiote",
        "Note",
        "*For a mild soup, skip the jalapeño and use smoked paprika. For a spicy soup, add the jalapeño and use chipotle powder in place of, or in addition to, smoked paprote"
      ]
    },
    {
      "name": "Slow cooker vegetarian lentil chili",
      "prep time": "10 min",
      "cook time": "4 hours",
      "servings": "6",
      "ingredients": [
        "1 yellow onion",
        "2 cloves garlic",
        "1 15oz. can petite diced tomatoes (with juices)",
        "1 6oz. can tomato paste",
        "1 15oz. can black beans, drained",
        "1 15oz. can kidney beans, drained",
        "1 cup brown lentils, uncooked",
        "1 Tbsp chili powder",
        "1 tsp smoked paprika",
        "1 tsp cumin",
        "1/2 tsp onion powder",
        "1/4 tsp garlic powder",
        "1/4 tsp cayenne pepper",
        "1/2 tsp salt",
        "freshly cracked pepper",
        "2 Tbsp coconut oil*",
        "4 cups vegetable broth"
      ],
      "instructions":[
        "Dice the onion and mince the garlic. Add the onion and garlic to the slow cooker, along with all the other ingredients to the slow cooker. Stir the ingredients in the slow cooker to combine.",
        "Place a lid on the slow cooker and cook on high for four hours (or low for 8 hours). After cooking, the lentils should be tender. Taste the chili and add salt to taste, if needed (this will depend on the salt content of your broth). ",
        "Serve the chili hot, with your favorite toppings.",
        "Note",
        "*I like to use coconut oil because it has a similar mouth feel to animal fat, but it does give a slight coconut aroma to the chili. Feel free to use your favorite oil or fat in its place."
      ]
    },
    {
      "name": "Smoky potato chickpea stew",
      "prep time": "10 min",
      "cook time": "1 hours",
      "servings": "6",
      "ingredients": [
        "2 Tbsp olive oil",
        "2 cloves garlic",
        "1 tsp fresh grated ginger",
        "1 onion",
        "1 Tbsp curry powder",
        "1 Tbsp smoked paprika",
        "pinch red pepper flakes",
        "15 oz can fire roasted diced tomatoes",
        "2 russet potatoes (1.75-2 lbs total)",
        "15 oz can chickpeas",
        "4 cups vegetable broth*",
        "1/4 lb. fresh kale, chopped"
      ],
      "instructions":[
        "Finely dice the onion, mince the garlic, and grate the ginger. Add the onion, garlic, and ginger to a large soup pot with the olive oil and sauté over medium heat until the onions are soft and transparent.",
        "Add the curry powder, smoked paprika, and red pepper flakes to the pot and continue to stir and cook for 1-2 minutes more to toast the spices.",
        "While the onion, garlic, and ginger are sautéing, peel the potatoes and cut them into 1-inch cubes. Drain the chickpeas. ",
        "Once the spices are toasted, add the potatoes, fire roasted diced tomatoes (with juices), and chickpeas to the pot. Pour the vegetable broth over top, then stir until everything is combined.",
        "Place a lid on the pot, turn the heat up to medium-high, and allow it to come to a boil. Once boiling, turn the heat down to low and allow the soup to simmer with the lid in place for 45 minutes, stirring occasionally.",
        "After 45 minutes, stir the stew well and smash the potatoes against the side of the pot to help them break down and thicken the stew. Add the chopped kale and stir it into the stew until it has wilted. Taste the soup and adjust the salt or other spices if desired. Serve hot with crusty bread or crackers."
      ]
    },
    {
      "name": "Name",
      "prep time": " min",
      "cook time": " min",
      "servings": "6",
      "ingredients": [
        "x g y",
        "x g y"
      ],
      "instructions":[
        "x",
        "x"
      ]
    },
    {
      "name": "Name",
      "prep time": " min",
      "cook time": " min",
      "servings": "6",
      "ingredients": [
        "x g y",
        "x g y"
      ],
      "instructions":[
        "x",
        "x"
      ]
    },
    {
      "name": "Name",
      "prep time": " min",
      "cook time": " min",
      "servings": "6",
      "ingredients": [
        "x g y",
        "x g y"
      ],
      "instructions":[
        "x",
        "x"
      ]
    },
    {
      "name": "Name",
      "prep time": " min",
      "cook time": " min",
      "servings": "6",
      "ingredients": [
        "x g y",
        "x g y"
      ],
      "instructions":[
        "x",
        "x"
      ]
    },
    {
      "name": "Name",
      "prep time": " min",
      "cook time": " min",
      "servings": "6",
      "ingredients": [
        "x g y",
        "x g y"
      ],
      "instructions":[
        "x",
        "x"
      ]
    },
    {
      "name": "Name",
      "prep time": " min",
      "cook time": " min",
      "servings": "6",
      "ingredients": [
        "x g y",
        "x g y"
      ],
      "instructions":[
        "x",
        "x"
      ]
    },
    {
      "name": "Name",
      "prep time": " min",
      "cook time": " min",
      "servings": "6",
      "ingredients": [
        "x g y",
        "x g y"
      ],
      "instructions":[
        "x",
        "x"
      ]
    },
    {
      "name": "Name",
      "prep time": " min",
      "cook time": " min",
      "servings": "6",
      "ingredients": [
        "x g y",
        "x g y"
      ],
      "instructions":[
        "x",
        "x"
      ]
    },
    {
      "name": "Name",
      "prep time": " min",
      "cook time": " min",
      "servings": "6",
      "ingredients": [
        "x g y",
        "x g y"
      ],
      "instructions":[
        "x",
        "x"
      ]
    },
    {
      "name": "Name",
      "prep time": " min",
      "cook time": " min",
      "servings": "6",
      "ingredients": [
        "x g y",
        "x g y"
      ],
      "instructions":[
        "x",
        "x"
      ]
    }
  ]
}